test_data = [
    # Основные тесты
    ("1234567", "СЛАБЫЙ"),
    ("Pass1234!", "СРЕДНИЙ"),
    ("StrongP@ss2025", "СИЛЬНЫЙ"),
    ("12345678", "СЛАБЫЙ"),
    ("password", "СЛАБЫЙ"),
    ("password123", "СЛАБЫЙ"),
    ("qwerty123", "СЛАБЫЙ"),
    ("", "ОШИБКА"),
    
    #Граничные случаи
    ("A1b2C3d", "СЛАБЫЙ"),      # 7 символов
    ("A1b2C3d!", "СРЕДНИЙ"),    # 8 символов
    ("A1b2C3d!E5", "СРЕДНИЙ"),  # 11 символов
    ("A1b2C3d!E5r", "СИЛЬНЫЙ"), # 12 символов
    
    ("Password1", "СРЕДНИЙ"),    # нет спецсимволов
    ("password1!", "СРЕДНИЙ"),   # нет заглавных
    
    ("Password2024", "СЛАБЫЙ"),  # год
    ("aaaaa123", "СЛАБЫЙ"),      # повторы
]

def run_auto_tests():
    """Запускает тесты (выводит список)"""
    print("АВТОМАТИЗИРОВАННЫЕ ТЕСТЫ")
    print("-" * 60)
    print()
    
    for password, expected in test_data:
        display = "[пусто]" if password == "" else password
        print(f"Пароль: '{display}' -> ожидается: {expected}")
    print()
    print(f"Всего тестов: {len(test_data)}")
    print("=" * 60)

run_auto_tests()